app/views/states/index.html.erb

  </tr>
  <% state.links.each do |link| %>
---
SELECT "links".* FROM "links" WHERE "links"."state_id" = 1