app/views/links/_form.html.erb


    <%= f.collection_select(:keyword_id, Keyword.all, :id, :text) %>
---
SELECT "keywords".* FROM "keywords"