app/views/links/index.html.erb

SELECT "links".* FROM "links" WHERE "links"."domain_id" = 1
---

			<% domain.links.each do |link| %>