app/views/keywords/index.html.erb

SELECT "links".* FROM "links" WHERE "links"."keyword_id" = 1
---
	  </tr>
	  <% keyword.links.each do |keyword| %>