app/controllers/domains_controller.rb

  def index
    @domains = Domain.all
---
SELECT "domains".* FROM "domains"