app/controllers/domains_controller.rb

  def index
    @domains = Link.all
---
SELECT "links".* FROM "links"