app/controllers/keywords_controller.rb

  def index
    @keywords = Keyword.all
    @links = Link.all
---
SELECT "keywords".* FROM "keywords"
SELECT "links".* FROM "links" WHERE "links"."keyword_id" = 1

  def create
    @keyword = Keyword.new(params[:keyword])
    @keyword = Keyword.find_or_create_by_text_and_id(:text => @keyword.text,:customer_id => @keyword.customer_id)
---
INSERT INTO "keywords" ("created_at", "customer_id", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Dec 2011 21:44:28 UTC +00:00], ["customer_id", nil], ["text", "My Keyword"], ["updated_at", Mon, 12 Dec 2011 21:44:28 UTC +00:00]]

  def edit
    @keyword = Keyword.find(params[:id])
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "1"]]

  def show
    @keyword = Keyword.find(params[:id])
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "1"]]