app/controllers/links_controller.rb

SELECT "links".* FROM "links"
SELECT "domains".* FROM "domains"
---
  def index
    @links = Link.all
    @domains = Domain.all

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @link = Link.find(params[:id])

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @link = Link.find(params[:id])

INSERT INTO "links" ("created_at", "customer_id", "domain_id", "keyword_id", "state_id", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "domains" ("created_at", "customer_id", "host", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Dec 2011 22:18:47 UTC +00:00], ["customer_id", nil], ["host", nil], ["updated_at", Mon, 12 Dec 2011 22:18:47 UTC +00:00]]
SELECT "domains".* FROM "domains" WHERE "domains"."host" = 'www.domain1.de' LIMIT 1
---
  def create
    @link = Link.new(params[:link])
    @link = Link.find_or_create_by_url_and_customer_id_and_keyword_id(:url => @link.url,:customer_id => @link.customer_id,:keyword_id => @link.keyword_id)
    @customer = Customer.find(params[:customer_id])
    @link.domain = Domain.find_or_create_by_host(@link.host)

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "links" SET "updated_at" = '2011-12-12 22:50:40.557127', "keyword_id" = 1 WHERE "links"."id" = 10
---
  def update
    @link = Link.find(params[:id])
    @link.update_attributes(params[:link])

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy